/*
1.下面关于IP地址的论述中哪个是不正确的？（ C ）
A 用户主机的IP地址可静态分配也可以动态分配
B IP地址有单播地址，也有多播地址
C 一个用户主机只能有一个IP地址
D 在以太局域网中使用ARP协议查找与一IP地址对应的MAC地址


2.tcp套接字中，不会阻塞的是哪一种操作？( D )
A read
B write
C accept
D bind


3.以下几条路由，10.1.193.0/24,10.1.194.0/24,10.1.196.0/24,10.1.198.0/24，如果进行路由汇聚，则能覆盖这几条路由地址的是（ C ）
A 10.1.192.0/22
B 10.1.200.0/22
C 10.1.192.0/21
D 10.1.224.0/20


4.当一台 PC 从一个网络移到另一个网络时,以下说法正确的是?( B )
A 它的 IP 地址和 MAC 地址都会改变
B 它的 IP 地址会改变,MAC 地址不会改变
C 它的 MAC 地址会改变,IP 地址不会改变
D 它的 MAC 地址、IP 地址都不会改变


5.在TCP/IP建立连接过程中，客户端或服务器的状态转移说法错误的是？
A 经历SYN_RECV状态
B 经历SYN_SEND状态
C 经历ESTABLISHED状态
D 经历TIME_WAIT状态
E 服务器在收到syn包时将加入半连接队列
F 服务器收到客户端的ack包后将从半连接队列删除<Paste>


6.ping下面是基于哪个协议？( A  )
A ICMP
B TCP
C IP
D UDP


7.下面关于TCP的描述,错误的是( C )
A:TCP是一种面向连接的协议,给用户进程提供可靠的全双工的字节流
B:TCP客户端和服务器之间建立连接需要经过3次握手
C:只要有一方主动关闭连接后,这个TCP连接就结束了
D:TCP在传输数据过程中必须保持着连接,这个连接会给通信过程增加开销


8.如果将网络IP段40.15.128.0/17划分成2个子网,则第一个子网IP段为40.15.128.0/18,则第二个子网为:( D )
A 40.15.129.0/18
B 40.15.128.128/18
C 40.15.192.0/17
D 40.15.192.0/18


9.下面对Host文件描述正确的是( C )
A 这个文件是批处理文件,用来指定域名的访问IP
B 一个DNS域名解析服务器文件,用于解析域名对应的IP地址
C 作用是网址域名与其对应的IP地址建立一个关联"数据库"
D 当用户输入网址后,系统首先到DNS服务器中寻找对应的IP地址,如果不存在会到Host文件中确定最终访问地址


10.下列选项中,属于"10.174.20.176/28"该网段的有效IP地址是:(  B  )
A 10.174.20.174
B 10.174.20.186
C 10.174.20.191
D 10.174.20.192

*/
